In [1]:
import pandas as pd
import numpy as np

In [2]:
students_performance = pd.read_csv('D:\Programming\sandbox\pandas\StudentsPerformance.csv')

In [3]:
students_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [8]:
students_performance.groupby("gender").mean()

        math score  reading score  writing score
gender
female   63.633205      72.608108      72.467181
male     68.728216      65.473029      63.311203

In [10]:
students_performance.groupby("gender").aggregate({"math score": "mean", "reading score": "mean"})

        math score  reading score
gender
female   63.633205      72.608108
male     68.728216      65.473029

In [11]:
students_performance.groupby("gender", as_index=False).aggregate({"math score": "mean", "reading score": "mean"})

   gender  math score  reading score
0  female   63.633205      72.608108
1    male   68.728216      65.473029

In [13]:
students_performance\
    .groupby("gender", as_index=False)\
    .aggregate({"math score": "mean", "reading score": "mean"})\
    .rename(columns={"math score" : "mean math score", "reading score":"mean reading score"})

   gender  mean math score  mean reading score
0  female        63.633205           72.608108
1    male        68.728216           65.473029

In [16]:
mean_scores = students_performance\
    .groupby(["gender", "race/ethnicity"])\
    .aggregate({"math score": "mean", "reading score": "mean"})\
    .rename(columns={"math score" : "mean math score", "reading score":"mean reading score"})

In [17]:
mean_scores

                       mean math score  mean reading score
gender race/ethnicity
female group A               58.527778           69.000000
       group B               61.403846           71.076923
       group C               62.033333           71.944444
       group D               65.248062           74.046512
       group E               70.811594           75.840580
male   group A               63.735849           61.735849
       group B               65.930233           62.848837
       group C               67.611511           65.424460
       group D               69.413534           66.135338
       group E               76.746479           70.295775

In [18]:
mean_scores.loc[("female", "group A")]

mean math score       58.527778
mean reading score    69.000000
Name: (female, group A), dtype: float64

In [19]:
mean_scores.loc[[("female", "group A"), ("male", "group B")]]

                       mean math score  mean reading score
gender race/ethnicity
female group A               58.527778           69.000000
male   group B               65.930233           62.848837

In [20]:
students_performance.sort_values(["gender", "math score"], ascending=False).groupby("gender").head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
149,male,group E,associate's degree,free/reduced,completed,100,100,93
623,male,group A,some college,standard,completed,100,96,86
625,male,group D,some college,standard,completed,100,97,99
916,male,group E,bachelor's degree,standard,completed,100,100,100
306,male,group E,some college,standard,completed,99,87,81
451,female,group E,some college,standard,none,100,92,97
458,female,group E,bachelor's degree,standard,none,100,100,100
962,female,group E,associate's degree,standard,none,100,100,100
114,female,group E,bachelor's degree,standard,completed,99,100,100
263,female,group E,high school,standard,none,99,93,90